In [1]:
import warnings
warnings.filterwarnings('ignore')

In [2]:
import pandas as pd

df = pd.read_csv('basic1.csv')
df.head()df = pd.read_csv('basic1.csv')

     id   age city    f1  f2   f3    f4         f5
0  id01   2.0   서울   NaN   0  NaN  ENFJ  91.297791
1  id02   9.0   서울  70.0   1  NaN  ENFJ  60.339826
2  id03  27.0   서울  61.0   1  NaN  ISTJ  17.252986
3  id04  75.0   서울   NaN   2  NaN  INFP  52.667078
4  id05  24.0   서울  85.0   2  NaN  ISFJ  29.269869

문제1

데이터셋(basic1.csv)의 'f5' 컬럼을 기준으로 상위 10개의 데이터를 구하고,

'f5'컬럼 10개 중 최소값으로 데이터를 대체한 후,

'age'컬럼에서 80 이상인 데이터의'f5 컬럼 평균값 구하기

In [3]:
df[df['age'] >= 80].f5.mean()

63.072327617391316

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100 entries, 0 to 99
Data columns (total 8 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   id      100 non-null    object
 1   age     100 non-null    float64
 2   city    100 non-null    object
 3   f1      69 non-null     float64
 4   f2      100 non-null    int64
 5   f3      5 non-null      object
 6   f4      100 non-null    object
 7   f5      100 non-null    float64
dtypes: float64(3), int64(1), object(4)
memory usage: 6.4+ KB

In [5]:
df=df.sort_values('f5', ascending = False)
df

      id   age city    f1  f2   f3    f4         f5
10  id11  40.0   서울  68.0   0  NaN  ENFP  98.429899
97  id98  39.0   경기  58.0   2  NaN  INFP  98.429899
9   id10  95.0   서울  74.0   1  NaN  ISFP  98.429899
76  id77  77.0   경기  31.0   0  NaN  INFP  98.429899
98  id99   1.0   경기  47.0   0  NaN  ESFJ  97.381034
..   ...   ...  ...   ...  ..  ...   ...        ...
54  id55  75.0   대구  63.0   2  NaN  ENTP  13.049921
35  id36  68.0   부산  77.0   1  NaN  INTP  13.049921
6   id07  36.3   서울  60.0   1  NaN  ISFJ   9.796378
90  id91   6.0   경기  72.0   0  NaN  INTP   9.796378
14  id15  22.0   서울  67.0   1  NaN  ENTP   9.796378

[100 rows x 8 columns]

In [6]:
df['f5'][:10] =  df['f5'].head(10).min()
df['f5']

10    91.297791
97    91.297791
9     91.297791
76    91.297791
98    91.297791
        ...
54    13.049921
35    13.049921
6      9.796378
90     9.796378
14     9.796378
Name: f5, Length: 100, dtype: float64

In [7]:
df[df['age'] >= 80].f5.mean()

62.49774712521738

문제2

데이터셋(basic1.csv)의 앞에서 순서대로 70% 데이터만 활용해서,

'f1'컬럼 결측치를 중앙값으로 채우기 전후의 표준편차를 구하고

두 표준편차 차이 계산하기

In [61]:
df = pd.read_csv('basic1.csv')

In [62]:
df.isnull().sum()

id       0
age      0
city     0
f1      31
f2       0
f3      95
f4       0
f5       0
dtype: int64

In [63]:
ddf = df[:70]
ddf

      id   age city    f1  f2   f3    f4         f5
0   id01   2.0   서울   NaN   0  NaN  ENFJ  91.297791
1   id02   9.0   서울  70.0   1  NaN  ENFJ  60.339826
2   id03  27.0   서울  61.0   1  NaN  ISTJ  17.252986
3   id04  75.0   서울   NaN   2  NaN  INFP  52.667078
4   id05  24.0   서울  85.0   2  NaN  ISFJ  29.269869
..   ...   ...  ...   ...  ..  ...   ...        ...
65  id66  87.0   경기   NaN   1  NaN  ISFP  17.252986
66  id67  66.0   경기  52.0   1  NaN  ISFJ  73.586397
67  id68  35.0   경기  45.0   2  NaN  ISFP  67.886373
68  id69  75.0   경기  85.0   0  NaN  ESTJ  69.730313
69  id70  -9.0   경기  96.0   1  NaN  ISTP  48.431184

[70 rows x 8 columns]

In [64]:
before_std = ddf['f1'].std()

In [65]:
ddf['f1'].median()

68.0

In [66]:
ddf.f1.fillna(ddf['f1'].median(), inplace = True)

In [67]:
after_std = ddf['f1'].std()

In [68]:
print(before_std, after_std)

17.98727579865276 14.690773995256688

In [69]:
before_std - after_std

3.2965018033960725

문제3

데이터셋(basic1.csv)의 'age'컬럼의 이상치를 더하시오!

단, 평균으로부터 '표준편차*1.5'를 벗어나는 영역을 이상치라고 판단함

In [72]:
over = df['age'].mean() + df['age'].std()*1.5
less = df['age'].mean() - df['age'].std()*1.5
print(over, less)

96.62713778388303 5.298862216116966

In [75]:
df[(df['age'] > over) | (df['age'] < less)].age.sum()

473.5